Revit 2027 API
Wall.RemoveAttachment(ElementId, AttachmentLocation) Method
 Removes an attachment at the top or base of a wall, if there is one.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveAttachment(
	ElementId targetId,
	AttachmentLocation attachmentLocation
)
Public Sub RemoveAttachment (
	targetId As ElementId,
	attachmentLocation As AttachmentLocation
)
public:
void RemoveAttachment(
	ElementId^ targetId,
	AttachmentLocation attachmentLocation
)
member RemoveAttachment :
        targetId : ElementId *
        attachmentLocation : AttachmentLocation -> unit
Parameters
targetId ElementId
 Target element id.
attachmentLocation AttachmentLocation
 The attachment location.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
Wall Class
RemoveAttachment Overload
Autodesk.Revit.DB Namespace